# Bank Dataset Project by David Smolinski
What this adds to my portfolio:
- common sql
- csv to pandas
- pandas to sql
- sql to pandas

Links:
- [my portfolio](https://github.com/DavidSmolinski/portfolio)
- [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Bank+Marketing)
- [the csv](https://archive.ics.uci.edu/ml/machine-learning-databases/00222/bank.zip)

In [12]:
import sqlite3, numpy as np, requests, pandas as pd
from io import BytesIO
from zipfile import ZipFile

# get the csv in the zipped folder at the url
zip_folder_url="https://archive.ics.uci.edu/ml/machine-learning-databases/00222/bank.zip"
response = requests.get(zip_folder_url)
with ZipFile(BytesIO(response.content)) as z:
    with z.open('bank.csv') as csv:
        df = pd.read_csv(csv, delimiter=';')

print(df.head(1))

   age         job  marital education default  balance housing loan   contact  \
0   30  unemployed  married   primary      no     1787      no   no  cellular

   day month  duration  campaign  pdays  previous poutcome   y
0   19   oct        79         1     -1         0  unknown  no

The next cell makes the database in RAM, and connects to it. To make or connect to a db file, use: 
connection = sqlite3.connect('path.db')

In [13]:
connection = sqlite3.connect(":memory:")

Method 1 of putting the dataframe (df) into the database (db):

In [14]:
df.to_sql('clients', connection)

Method 2 of putting the dataframe into the database:

In [15]:
c = connection.cursor()

c.execute("""CREATE TABLE IF NOT EXISTS clients (
             "index" SMALLINT PRIMARY KEY,
             age TINYINT,
             job VARCHAR(15),
             marital VARCHAR(10),
             education VARCHAR(10),
             "default" VARCHAR(3),
             balance BIGINT,
             housing VARCHAR(3),
             loan VARCHAR(3),
             contact VARCHAR(10),
             day TINYINT,
             month VARCHAR(3),
             duration SMALLINT,
             campaign TINYINT,
             pdays SMALLINT,
             previous TINYINT,
             poutcome VARCHAR(10),
             y VARCHAR(3)
             )""")


for row in range(len(df)):
    row_tuple = (row,)
    for col in range(len(df.columns)):
        val = df.iloc[row, col]
        if isinstance(val, np.int64):
            val = int(val)
        row_tuple += (val,)
    with connection:
        c.execute(
            """INSERT INTO clients ("index", age, job, marital, education, "default", balance, housing, loan, contact, day, 
            month, duration, campaign, pdays, previous, poutcome, y) VALUES 
            (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)""",
            row_tuple)

querying the database:

In [16]:
query_number = 1


def print_column_names(connection, table):
    c = connection.cursor()
    c.execute("""PRAGMA table_info(""" + table + ")")
    table_info = c.fetchall()
    column_names = [e[1] for e in table_info]
    print(f"\n\ncolumn names\n{column_names}")


def query(connection, query_number, sql_code):
    c = connection.cursor()
    c.execute(sql_code)
    print(f"\n\nquery {query_number}:\n\nsql:\n{sql_code}\n\nresult:\n{c.fetchall()}")
    query_number += 1
    return query_number


print_column_names(connection, "clients")

sql_code = """SELECT * FROM clients WHERE "index" < 40 ORDER BY age, balance ASC LIMIT 5"""
query_number = query(connection=connection, query_number=query_number, sql_code=sql_code)

sql_code = """SELECT education AS ed, balance FROM clients 
              WHERE job IN('housemaid', 'entrepreneur', 'student') AND balance between 500 AND 2000"""
query_number = query(connection, query_number, sql_code)

sql_code = """SELECT job, SUM(balance) FROM clients GROUP BY job"""
query_number = query(connection, query_number, sql_code)

sql_code = """SELECT DISTINCT education FROM clients WHERE education LIKE '%r%a_y'"""
query_number = query(connection, query_number, sql_code)

sql_code = """SELECT DISTINCT age FROM clients WHERE education =
              (SELECT DISTINCT education FROM clients WHERE balance >30000)"""
query_number = query(connection, query_number, sql_code)

sql_code = """SELECT DISTINCT age FROM clients WHERE education =
              (SELECT DISTINCT education FROM clients WHERE balance >30000)"""
query_number = query(connection, query_number, sql_code)

column names
['index', 'age', 'job', 'marital', 'education', 'default', 'balance', 'housing', 'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y']


query 1:

sql:
SELECT * FROM clients WHERE "index" < 40 ORDER BY age, balance ASC LIMIT 5

result:
[(13, 20, 'student', 'single', 'secondary', 'no', 502, 'no', 'no', 'cellular', 30, 'apr', 261, 1, -1, 0, 'unknown', 'yes'), (13, 20, 'student', 'single', 'secondary', 'no', 502, 'no', 'no', 'cellular', 30, 'apr', 261, 1, -1, 0, 'unknown', 'yes'), (39, 23, 'services', 'single', 'tertiary', 'no', 363, 'yes', 'no', 'unknown', 30, 'may', 16, 18, -1, 0, 'unknown', 'no'), (39, 23, 'services', 'single', 'tertiary', 'no', 363, 'yes', 'no', 'unknown', 30, 'may', 16, 18, -1, 0, 'unknown', 'no'), (18, 25, 'blue-collar', 'single', 'primary', 'no', -221, 'yes', 'no', 'unknown', 23, 'may', 250, 1, -1, 0, 'unknown', 'no')]


query 2:

sql:
SELECT education AS ed, balance FROM clients
              WHERE job IN('housemaid', 'entrepreneur', 'student') AND balance between 500 AND 2000

result:
[('secondary', 502), ('tertiary', 543), ('tertiary', 624), ('secondary', 872), ('secondary', 593), ('secondary', 687), ('secondary', 780), ('secondary', 946), ('secondary', 665), ('unknown', 1034), ('tertiary', 890), ('primary', 1034), ('tertiary', 1161), ('secondary', 1790), ('tertiary', 810), ('unknown', 1281), ('tertiary', 1957), ('primary', 976), ('tertiary', 595), ('tertiary', 1790), ('primary', 768), ('secondary', 725), ('primary', 501), ('primary', 517), ('unknown', 549), ('tertiary', 1467), ('secondary', 868), ('secondary', 653), ('secondary', 1116), ('secondary', 1021), ('primary', 1238), ('tertiary', 1544), ('tertiary', 1562), ('secondary', 1191), ('primary', 889), ('tertiary', 1729), ('secondary', 757), ('tertiary', 1410), ('secondary', 1566), ('primary', 668), ('primary', 1832), ('secondary', 508), ('tertiary', 1265), ('secondary', 671), ('secondary', 822), ('secondary', 1924), ('secondary', 681), ('tertiary', 1169), ('primary', 592), ('secondary', 654), ('secondary', 565), ('tertiary', 807), ('unknown', 1387), ('tertiary', 1273), ('secondary', 1011), ('unknown', 575), ('secondary', 1532), ('secondary', 1327), ('tertiary', 1574), ('primary', 848), ('secondary', 1694), ('tertiary', 836), ('tertiary', 691), ('tertiary', 1514), ('tertiary', 1433), ('secondary', 806), ('tertiary', 1922), ('secondary', 1916), ('unknown', 1169), ('primary', 795), ('secondary', 1309), ('secondary', 1847), ('secondary', 1416), ('secondary', 1040), ('secondary', 1249), ('secondary', 1847), ('unknown', 1956), ('secondary', 1588), ('secondary', 538), ('secondary', 638), ('tertiary', 868), ('primary', 563), ('secondary', 1121), ('tertiary', 1136), ('secondary', 502), ('tertiary', 543), ('tertiary', 624), ('secondary', 872), ('secondary', 593), ('secondary', 687), ('secondary', 780), ('secondary', 946), ('secondary', 665), ('unknown', 1034), ('tertiary', 890), ('primary', 1034), ('tertiary', 1161), ('secondary', 1790), ('tertiary', 810), ('unknown', 1281), ('tertiary', 1957), ('primary', 976), ('tertiary', 595), ('tertiary', 1790), ('primary', 768), ('secondary', 725), ('primary', 501), ('primary', 517), ('unknown', 549), ('tertiary', 1467), ('secondary', 868), ('secondary', 653), ('secondary', 1116), ('secondary', 1021), ('primary', 1238), ('tertiary', 1544), ('tertiary', 1562), ('secondary', 1191), ('primary', 889), ('tertiary', 1729), ('secondary', 757), ('tertiary', 1410), ('secondary', 1566), ('primary', 668), ('primary', 1832), ('secondary', 508), ('tertiary', 1265), ('secondary', 671), ('secondary', 822), ('secondary', 1924), ('secondary', 681), ('tertiary', 1169), ('primary', 592), ('secondary', 654), ('secondary', 565), ('tertiary', 807), ('unknown', 1387), ('tertiary', 1273), ('secondary', 1011), ('unknown', 575), ('secondary', 1532), ('secondary', 1327), ('tertiary', 1574), ('primary', 848), ('secondary', 1694), ('tertiary', 836), ('tertiary', 691), ('tertiary', 1514), ('tertiary', 1433), ('secondary', 806), ('tertiary', 1922), ('secondary', 1916), ('unknown', 1169), ('primary', 795), ('secondary', 1309), ('secondary', 1847), ('secondary', 1416), ('secondary', 1040), ('secondary', 1249), ('secondary', 1847), ('unknown', 1956), ('secondary', 1588), ('secondary', 538), ('secondary', 638), ('tertiary', 868), ('primary', 563), ('secondary', 1121), ('tertiary', 1136)]


query 3:

sql:
SELECT job, SUM(balance) FROM clients GROUP BY job

result:
[('admin.', 1172760), ('blue-collar', 2053126), ('entrepreneur', 552762), ('housemaid', 466772), ('management', 3424308), ('retired', 1066828), ('self-employed', 509622), ('services', 920700), ('student', 259362), ('technician', 2044410), ('unemployed', 278892), ('unknown', 114130)]


query 4:

sql:
SELECT DISTINCT education FROM clients WHERE education LIKE '%r%a_y'

result:
[('primary',), ('tertiary',)]


query 5:

sql:
SELECT DISTINCT age FROM clients WHERE education =
              (SELECT DISTINCT education FROM clients WHERE balance >30000)

result:
[(35,), (30,), (36,), (41,), (40,), (37,), (42,), (26,), (32,), (49,), (23,), (38,), (34,), (33,), (48,), (31,), (54,), (58,), (46,), (51,), (77,), (52,), (28,), (39,), (29,), (45,), (53,), (50,), (44,), (59,), (47,), (43,), (25,), (60,), (56,), (57,), (75,), (55,), (66,), (27,), (22,), (71,), (64,), (61,), (24,), (70,), (78,), (69,), (62,), (63,), (67,)]


query 6:

sql:
SELECT DISTINCT age FROM clients WHERE education =
              (SELECT DISTINCT education FROM clients WHERE balance >30000)

result:
[(35,), (30,), (36,), (41,), (40,), (37,), (42,), (26,), (32,), (49,), (23,), (38,), (34,), (33,), (48,), (31,), (54,), (58,), (46,), (51,), (77,), (52,), (28,), (39,), (29,), (45,), (53,), (50,), (44,), (59,), (47,), (43,), (25,), (60,), (56,), (57,), (75,), (55,), (66,), (27,), (22,), (71,), (64,), (61,), (24,), (70,), (78,), (69,), (62,), (63,), (67,)]

making a dataframe from the database:

In [17]:
sql = "SELECT * FROM clients"
df = pd.read_sql(sql, connection)
print(df.head(3))

   index  age         job  marital  education default  balance housing loan  \
0      0   30  unemployed  married    primary      no     1787      no   no
1      1   33    services  married  secondary      no     4789     yes  yes
2      2   35  management   single   tertiary      no     1350     yes   no

    contact  day month  duration  campaign  pdays  previous poutcome   y
0  cellular   19   oct        79         1     -1         0  unknown  no
1  cellular   11   may       220         1    339         4  failure  no
2  cellular   16   apr       185         1    330         1  failure  no

In [18]:
connection.close()

dataset citations:

[Moro et al., 2011] S. Moro, R. Laureano and P. Cortez. Using Data Mining for Bank Direct Marketing: An Application of the CRISP-DM Methodology. 
  In P. Novais et al. (Eds.), Proceedings of the European Simulation and Modelling Conference - ESM'2011, pp. 117-121, Guimarães, Portugal, October, 2011. EUROSIS.

  Available at: [pdf] http://hdl.handle.net/1822/14838
                [bib] http://www3.dsi.uminho.pt/pcortez/bib/2011-esm-1.txt